Revit 2024 API
ACADExportOptions Class
 The base class for options used to export DWG and DXF format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ACADExportOptions : BaseExportOptions
Visual Basic
Public Class ACADExportOptions _
	Inherits BaseExportOptions
Visual C++
public ref class ACADExportOptions : public BaseExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
 Autodesk.Revit.DB.DXFExportOptions
See Also
ACADExportOptions Members
Autodesk.Revit.DB Namespace